<?php
/*
+ ----------------------------------------------------------------------------------------------+
|     e107 website system  : http://e107.org.ru
|     Released under the terms and conditions of the GNU General Public License (http://gnu.org).
|
|     Plugin "eCallCentre"
|     Author: Alex ANP alex-anp@ya.ru
|     Home page: http://code.google.com/p/ecallcentre/
+-----------------------------------------------------------------------------------------------+
*/

/*======================= Константы =========================*/
define("eCC_LIMIT", '50');         # Размер пейджинга, он же лимит выборки
define("eCC_CUTTER", '13');        # Длинна обрезаемых строк
define("eCC_SEPARATOR", '__TCS__');		# Сепаратор комментариев

/*======================= Строки =========================*/
define("PAGE_NAME", "eCallCentre");
define("eCC_L0001", "Клиентов поддержки центр");
define("eCC_L0002", "Сайт проекта <a href=http://code.google.com/p/ecallcentre/>eCallCentre</a>. Плагин разрабатывается при поддержке компании <a href=http://binarius.ru>Бинариус</a>");
define("eCC_L0003", "eCallCentre &copy; <a href=http://binarius.ru>binarius.ru</a>");
define("eCC_L0010", "Новый клиент");
define("eCC_L0011", "Название клиента");
define("eCC_L0012", "Контактное лицо");
define("eCC_L0013", "Адрес");
define("eCC_L0014", "Телефон");
define("eCC_L0015", "e-mail");
define("eCC_L0016", "Сайт");
define("eCC_L0017", "Пометки");
define("eCC_L0018", "Сохранить");
define("eCC_L0019", "Отменить");
define("eCC_L0020", "Клиенты");
define("eCC_L0021", "Клиент, редактирование");
define("eCC_L0022", "Новое оборудование");
define("eCC_L0023", "Инвентарный номер");
define("eCC_L0024", "Наименование оборудования");
define("eCC_L0025", "Оборудование");
define("eCC_L0026", "Добавить оборудование");
define("eCC_L0027", "Заявки");
define("eCC_L0028", "Имя заявителя");
define("eCC_L0029", "Суть заявки");
define("eCC_L0030", "Описание заявки");
define("eCC_L0031", "Исполнитель");
define("eCC_L0032", "Способ приема заявки");
define("eCC_L0033", "Телефон");
define("eCC_L0034", "Почта");
define("eCC_L0035", "Наш сотрудник");
define("eCC_L0036", "Статус");
define("eCC_L0037", "Открыта");
define("eCC_L0038", "Решается");
define("eCC_L0039", "Закрыта");
define("eCC_L0040", "Критичность");
define("eCC_L0041", "Высокая");
define("eCC_L0042", "Нормальная");
define("eCC_L0043", "Низкая");
define("eCC_L0044", "Добавить заявку");
define("eCC_L0045", "Новая заявка");
define("eCC_L0046", "Заявка, редактирование");
define("eCC_L0047", "Клиент");
define("eCC_L0048", "Заявка №");
define("eCC_L0049", "Логин");
define("eCC_L0050", "Пароль");
define("eCC_L0051", "Вход");
define("eCC_L0052", "Личный кабинет клиента");
define("eCC_L0053", "Выход");
define("eCC_L0054", "Досвидания, спасибо что зашли :)");
define("eCC_L0055", "Авторизация");
define("eCC_L0056", "Создан");
define("eCC_L0057", "Изменен");
define("eCC_L0058", "Решение");
define("eCC_L0059", "Автор");
define("eCC_L0060", "Поле");
define("eCC_L0061", "Старое значение");
define("eCC_L0062", "Новое значение");
define("eCC_L0063", "Журнал");
define("eCC_L0064", "Объект");
define("eCC_L0065", "Крайний срок");
define("eCC_L0066", "Архив заявок");
define("eCC_L0067", "Показать");
define("eCC_L0068", "Укажите период времени для выборки заявок из архива, минимум одну дату");
define("eCC_L0069", "--ПРОСРОЧЕНА--");
define("eCC_L0070", "Комментарии");
define("eCC_L0071", "Личная встреча");
define("eCC_L0072", "Приложение");
define("eCC_L0073", "Выбрано записей");
define("eCC_L0074", "Выезд");
define("eCC_L0075", "Ожидание");
define("eCC_L0076", "Ожидание проверки и выбора исполнителя");
define("eCC_L0077", "Выставление счета");
define("eCC_L0078", "Оплата счета");

/*================== Админка строки ===================*/
define("eCC_A001", "Манагеры <br/><i>Класс пользователей которым будет позволено работать c плагином.</i>");
define("eCC_A002", "Технари <br/><i>Класс пользователей c более высоким приоритетом (пока не совсем ясно для чего именно).</i>");
define("eCC_A003", "Клиенты <br/><i>Класс пользователей для доступа в личный кабинет.</i>");
define("eCC_A004", "Настройки сохранены");
define("eCC_A005", "Настройки палгина (".eCC_L0001.")");
define("eCC_A006", "Сохранить настройки");
define("eCC_A007", "Файл css для ЛК клиента");
define("eCC_A008", "Пароль для входа от имени клиента <br/><i>Логин в формате __client__N - где N - номер клиента (ID).</i>");
define("eCC_A009", "Ответственный исполнитель по заявкам от клиентов");

#======================== Меню =========================#
define("eCC_LM001", "Навигация");
define("eCC_LM002", "Руководство");
define("eCC_LM003", "Активные заявки");
define("eCC_LM004", "Закрытые заявки");
define("eCC_LM005", "Все заявки");
define("eCC_LM006", "Мои заявки");
define("eCC_LM007", "Журнал");
define("eCC_LM008", "Архив заявок");

?>

